; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image6 - mode
	thermograph1 - mode
	image3 - mode
	image5 - mode
	image2 - mode
	spectrograph0 - mode
	spectrograph4 - mode
	Star4 - direction
	Star5 - direction
	GroundStation3 - direction
	Star1 - direction
	Star0 - direction
	Star2 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 spectrograph4)
	(supports instrument1 spectrograph0)
	(supports instrument1 image2)
	(supports instrument1 image6)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star2)
	(supports instrument2 thermograph1)
	(supports instrument2 image5)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
)
(:goal (and
	(have_image Planet6 spectrograph4)
	(have_image Planet6 image3)
	(have_image Planet7 image5)
	(have_image Planet7 thermograph1)
	(have_image Phenomenon8 image3)
	(have_image Phenomenon9 image3)
	(have_image Planet10 image2)
	(have_image Planet10 image5)
	(have_image Phenomenon11 image3)
	(have_image Phenomenon11 spectrograph4)
))

)

; plan
1. (turn_to satellite0 groundstation3 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 10
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
3. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 10
4. (turn_to satellite0 planet6 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet6)
   goals met: 0 of 10
5. (take_image satellite0 planet6 instrument0 spectrograph4)
   added: (have_image planet6 spectrograph4)
   goals met: 1 of 10
6. (take_image satellite0 planet6 instrument0 image3)
   added: (have_image planet6 image3)
   goals met: 2 of 10
7. (turn_to satellite0 phenomenon9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 10
8. (take_image satellite0 phenomenon9 instrument0 image3)
   added: (have_image phenomenon9 image3)
   goals met: 3 of 10
9. (turn_to satellite0 phenomenon8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 10
10. (take_image satellite0 phenomenon8 instrument0 image3)
   added: (have_image phenomenon8 image3)
   goals met: 4 of 10
11. (turn_to satellite0 phenomenon11 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 10
12. (take_image satellite0 phenomenon11 instrument0 spectrograph4)
   added: (have_image phenomenon11 spectrograph4)
   goals met: 5 of 10
13. (take_image satellite0 phenomenon11 instrument0 image3)
   added: (have_image phenomenon11 image3)
   goals met: 6 of 10
14. (turn_to satellite0 star0 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star0)
   goals met: 6 of 10
15. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 6 of 10
16. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 6 of 10
17. (calibrate satellite0 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 6 of 10
18. (turn_to satellite0 planet10 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet10)
   goals met: 6 of 10
19. (take_image satellite0 planet10 instrument2 image5)
   added: (have_image planet10 image5)
   goals met: 7 of 10
20. (turn_to satellite0 planet7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet7)
   goals met: 7 of 10
21. (take_image satellite0 planet7 instrument2 image5)
   added: (have_image planet7 image5)
   goals met: 8 of 10
22. (take_image satellite0 planet7 instrument2 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 9 of 10
23. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 9 of 10
24. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 9 of 10
25. (turn_to satellite0 star1 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star1)
   goals met: 9 of 10
26. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 9 of 10
27. (turn_to satellite0 planet10 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet10)
   goals met: 9 of 10
28. (take_image satellite0 planet10 instrument1 image2)
   added: (have_image planet10 image2)
   goals met: 10 of 10
